Tekla Open API Reference for Tekla Structures 2025
DrawingObject.IsEqual Method
 Compares the current object with the given object. Checks every field of both objects for equality.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract bool IsEqual(
	Object ObjectToCompare
)
Public MustOverride Function IsEqual (
	ObjectToCompare As Object
) As Boolean
Parameters
ObjectToCompare
Type: System.Object
An object of the same type to be used for comparing.
Return Value
Type: Boolean
True if all the fields (except for the database GUID) of the objects match.
Implements
IIsEqual.IsEqual(Object)
See Also
Reference
DrawingObject Class
Tekla.Structures.Drawing Namespace